//
// Generated by dtk
// Translation Unit: d_a_kytag00.cpp
//
#include "JSystem/JKernel/JKRHeap.h"
#include "f_op/f_op_actor.h"
#include "d/d_kankyo.h"
#include "d/d_procname.h"
#include "mtx/vec.h"
#include "dolphin/types.h"

class kytag00_class : fopAc_ac_c {
public:
    /* 0x00 */ u8 unk1;
    /* 0x01 */ u8 unk2;
    /* 0x02 */ u8 unk3;
    /* 0x03 */ u8 unk4;
    /* 0x04 */ u8 mbEfSet;
    /* 0x05 */ u8 bPselSet;
    /* 0x06 */ u8 unk5;
    /* 0x07 */ u8 mPselIdx;
    /* 0x08 */ u8 mEffectMode;
    /* 0x09 */ u8 unk6;
    /* 0x0A */ u8 unk7;
    /* 0x0B */ u8 unk8;
    /* 0x0C */ u32 mParamRadius;
    /* 0x10 */ int minnerFadeY;
    /* 0x14 */ f32 minnerRadius;
    /* 0x1C */ f32 mOuterRadius;
    /* 0x20 */ f32 mTarget;
    /* 0x24 */ u8 mSwitchID;
    /* 0x25 */ u8 mbInvert;
    /* 0x26 */ u8 mbAlwaysCheckPlayerPos;
    /* 0x27 */ u8 unk9;
}; // Size: 0x27

/* 00000078-0000024C       .text get_check_pos__FP13kytag00_class */
void get_check_pos(kytag00_class* i_this) {
    f32 sp18;
    f32 sp14;
    f32 sp10;
    f32 spC;
    f32 sp8;
    f32 temp_f1;
    f32 var_f1;
    f32 var_f31;
    f64 temp_f0;
    f64 temp_f0_2;
    f64 temp_f0_3;
    f64 temp_f0_4;
    f64 temp_f0_5;
    f64 temp_f0_6;
    void *temp_r28;
    daPy_py_c *mpPlayer;
    camera_class *mpCamera;

    //temp_r28 = M2C_ERROR(/* Read from unset register $r4 */);
    temp_r29 = g_dComIfG_gameInfo.play.mpPlayer[0];
    temp_r30 = g_dComIfG_gameInfo.play.mCameraInfo[0]->mpCamera;
    temp_f1 = PSVECSquareDistance(i_this->current.pos, temp_r29 + 0xD8);
    if (temp_f1 > @4129.unk0) {
        temp_f0 = __frsqrte(temp_f1);
        temp_f0_2 = @4129.unk8 * temp_f0 * (@4129.unk10 - ((f64) temp_f1 * (temp_f0 * temp_f0)));
        temp_f0_3 = @4129.unk8 * temp_f0_2 * (@4129.unk10 - ((f64) temp_f1 * (temp_f0_2 * temp_f0_2)));
        spC = (f32) ((f64) temp_f1 * (@4129.unk8 * temp_f0_3 * (@4129.unk10 - ((f64) temp_f1 * (temp_f0_3 * temp_f0_3)))));
        var_f31 = spC;
    } else {
        var_f31 = temp_f1;
    }
    var_f1 = PSVECSquareDistance(temp_r28 + 0x1F8, temp_r30 + 0x1F8);
    if (var_f1 > @4129.unk0) {
        temp_f0_4 = __frsqrte(var_f1);
        temp_f0_5 = @4129.unk8 * temp_f0_4 * (@4129.unk10 - ((f64) var_f1 * (temp_f0_4 * temp_f0_4)));
        temp_f0_6 = @4129.unk8 * temp_f0_5 * (@4129.unk10 - ((f64) var_f1 * (temp_f0_5 * temp_f0_5)));
        sp8 = (f32) ((f64) var_f1 * (@4129.unk8 * temp_f0_6 * (@4129.unk10 - ((f64) var_f1 * (temp_f0_6 * temp_f0_6)))));
        var_f1 = sp8;
    }
    if (((u8) g_dComIfG_gameInfo.unk529A != 0) && ((u8) temp_r28->unk2B2 == 0)) {
        if (var_f31 < var_f1) {
            sp10 = temp_r29->unkD8;
            sp14 = temp_r29->unkDC;
            sp18 = temp_r29->unkE0;
        } else {
            sp10 = temp_r30->unk1F8;
            sp14 = temp_r30->unk1FC;
            sp18 = temp_r30->unk200;
        }
    } else {
        sp10 = temp_r30->unk1F8;
        sp14 = temp_r30->unk1FC;
        sp18 = temp_r30->unk200;
    }
    arg0->unk0 = sp10;
    arg0->unk4 = sp14;
    arg0->unk8 = sp18;
}

/* 0000024C-000005E4       .text wether_tag_move__FP13kytag00_class */
BOOL wether_tag_move(kytag00_class*) {
    /* Nonmatching */
    return 1;
}

/* 000005E4-000006A0       .text raincnt_set__Ff */
void raincnt_set(float flt) {
    s32 var_r31 = 0;

    if (dKy_checkEventNightStop() != 0) {
        s32 temp_r3 = (250.0f * (flt * (flt * flt)));
        if (g_env_light.mRainCount < temp_r3) {
            var_r31 = g_env_light.mRainCount;
        }
    } else {
        var_r31 = (250.0f * (flt * (flt * flt)));
    }
    if (var_r31 > g_env_light.mRainCountOrig) {
        g_env_light.mRainCount = var_r31;
    }
}

/* 000006A0-000006D8       .text raincnt_cut__Fv */
void raincnt_cut() {
    if (dKy_checkEventNightStop() == 0) {
        g_env_light.mRainCount = g_env_light.mRainCountOrig;
    }
}

/* 000006D8-00000C0C       .text wether_tag_efect_move__FP13kytag00_class */
BOOL wether_tag_efect_move(kytag00_class*) {
    /* Nonmatching */
    return 1;
}

/* 00000C0C-00000C30       .text daKytag00_Draw__FP13kytag00_class */
BOOL daKytag00_Draw(kytag00_class* i_this) {
    wether_tag_efect_move(i_this);
    return true;
}

/* 00000C30-00000D44       .text daKytag00_Execute__FP13kytag00_class */
BOOL daKytag00_Execute(kytag00_class*) {
    /* Nonmatching */
    return 1;
}

/* 00000D44-00000D4C       .text daKytag00_IsDelete__FP13kytag00_class */
BOOL daKytag00_IsDelete(kytag00_class*) {
    return true;
}

/* 00000D4C-00000D64       .text daKytag00_Delete__FP13kytag00_class */
BOOL daKytag00_Delete(kytag00_class*) {
    g_env_light.mMoyaCount = 0;
    return true;
}

/* 00000D64-00000F8C       .text daKytag00_Create__FP10fopAc_ac_c */
BOOL daKytag00_Create(fopAc_ac_c*) {
    /* Nonmatching */
    return 1;
}

static actor_method_class l_kytag00__Method = {
    (process_method_func)daKytag00_Execute,
    (process_method_func)daKytag00_Draw,
    (process_method_func)daKytag00_IsDelete,
    (process_method_func)daKytag00_Delete,
    (process_method_func)daKytag00_Create
};

extern actor_process_profile_definition g_profile_KYTAG00 = {
    fpcLy_CURRENT_e,
    7,
    fpcLy_CURRENT_e,
    PROC_KYTAG00,
    &g_fpcLf_Method.mBase,
    sizeof(kytag00_class),
    0,
    0,
    &g_fopAc_Method.base,
    0xA6,
    &l_kytag00__Method,
    0x00044000,
    fopAc_ACTOR_e,
    fopAc_CULLBOX_0_e,
};
